# Create and Connect a New Database

# CRUID operations in Database
* create
* read
* update
* insert
* delete

In [1]:
import sqlite3

In [2]:
con = sqlite3.connect('std.db')

# we need cursor to execute sql query

In [3]:
cur = con.cursor()

# creating table in sql

```sql

create table table_name (roll_no int, name varchar(20), address varchar(50))

```

In [4]:
create_table = """
Create table student (roll_no int not null, name varchar(20), address varchar(50))
"""

In [5]:
cur.execute(create_table)

# Insert statement in sql

```sql

INSERT INTO TABLE(col_1, col_2, ....... col_n)
values(val_1, val_2, ........val_n)

```

In [8]:
insert_data = '''
insert into student(roll_no, name, address)
values
(1, "sijan", "Gongabu"),
(2, "ram", "baneshwor"),
(3, "shyam", "patan")
'''

In [9]:
cur.execute(insert_data)

# Read in SQL/ Select Statement in SQL

```sql

Select * from table_name

```

In [10]:
read_query = """Select * from student"""

In [13]:
cur.execute(read_query)

In [14]:
cur.execute(read_query).fetchall()

[(1, 'sijan', 'Gongabu'), (2, 'ram', 'baneshwor'), (3, 'shyam', 'patan')]

In [15]:
query = """
SELECT name from student where roll_no = 1
"""

In [16]:
cur.execute(query).fetchall()

[('sijan',)]

In [17]:
address = """
SELECT address from student where roll_no = 3
"""

In [19]:
cur.execute(address).fetchall()

[('patan',)]

In [20]:
data = """
SELECT * from student where address = "patan"
"""

In [21]:
cur.execute(data).fetchall()

[(3, 'shyam', 'patan')]

# find name of people who lives in patan

In [23]:
cur.execute("Select name from student where address = 'patan'").fetchall()

[('shyam',)]

# UPDATE IN SQL

``` sql

UPDATE table_name set column_name = val
where condition

```

In [27]:
update = """UPDATE student set name = 'Sijan Shrestha' where roll_no = 1"""

In [28]:
cur.execute(update)

In [30]:
cur.execute("select * from student where roll_no = 1").fetchall()

[(1, 'Sijan Shrestha', 'Gongabu')]

# DELETE query in SQL

In [31]:
```sql



```

SyntaxError: invalid syntax (1599315148.py, line 1)

In [32]:
cur.execute("delete from student where roll_no = 1")

In [33]:
cur.execute("select * from student").fetchall()

[(2, 'ram', 'baneshwor'), (3, 'shyam', 'patan')]